In [8]:
import pandas as pd
#âŒ˜ + Space (Mac) to bring up something
# to run shortcut >> shift + enter

In [9]:
df = pd.read_csv("salaries_by_college_major.csv")
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [10]:
# to see the number of rows and columns, ther is 51 rows and 6 columns
df.shape

(51, 6)

In [ ]:
#can access the column names directly with the columns attribute.
df.columns

In [ ]:
#look for NaN (Not A Number) values in our dataframe.
df.isna

In [11]:
#Delete the Last Row: The first way is to manually remove the row at index 50
#The second way is to simply use the .dropna() method from pandas
clean_df = df.dropna()
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

In [ ]:
#To find the highest starting salary we can simply chain the .max() method.
clean_df["Starting Median Salary"].max()

In [ ]:
#the .idxmax() method will give us index for the row with the largest value
clean_df["Starting Median Salary"].idxmax()

In [ ]:
#To see the name of the major that corresponds to that particular row, we can use the .loc (location) property.
clean_df['Starting Median Salary'].loc[43]

In [12]:
#If you don't specify a particular column you can use the .loc property to retrieve an entire row
clean_df.loc[43]

Undergraduate Major                  Physician Assistant
Starting Median Salary                           74300.0
Mid-Career Median Salary                         91700.0
Mid-Career 10th Percentile Salary                66400.0
Mid-Career 90th Percentile Salary               124000.0
Group                                               STEM
Name: 43, dtype: object

In [14]:
#Challenge 1: What college major has the highest mid-career salary?  How much do graduates with this major earn?
#(Mid-career is defined as having 10+ years of experience).
# to anwer is : Chemical Engineering and $107000.0
print(clean_df['Mid-Career Median Salary'].max())
print(f"Index for the max mid career salary:{clean_df['Mid-Career Median Salary'].idxmax()}")
clean_df['Undergraduate Major'].loc[8]

107000.0
Index for the max mid career salary:8

'Chemical Engineering'

In [20]:
# Challenge 2 Which college major has the lowest starting salary and how much do graduates earn after university?
# the answer is Spanish and $34000.0
print(clean_df['Starting Median Salary'].min())
# print(f"Index for the lowest starting salary:{clean_df['Starting Median Salary'].idxmin()}")
# clean_df['Undergraduate Major'].loc[49]

# use the .loc property to access an entire row:
clean_df['Undergraduate Major'].loc[clean_df['Starting Median Salary'].idxmin()]

34000.0

'Spanish'

In [16]:
#Challenge 3 Which college major has the lowest mid-career salary and how much can people expect to earn with this degree? 
# the answer is Education and  $52000.0
print(clean_df['Mid-Career Median Salary'].min())
print(f"Index for the lowest mid-career salary:{clean_df['Mid-Career Median Salary'].idxmin()}")
clean_df['Undergraduate Major'].loc[18]

52000.0
Index for the lowest mid-career salary:18

'Education'

In [32]:
#Lowest Risk Majors
#clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
#Alternatively, you can also use the .subtract() method.
clean_df['Mid-Career 90th Percentile Salary'].subtract(clean_df['Mid-Career 10th Percentile Salary'])

0     109800.0
1      96700.0
2     113700.0
3     104200.0
4      85400.0
5      96200.0
6      98100.0
7     108200.0
8     122100.0
9     102700.0
10     84600.0
11    105500.0
12     95900.0
13     98000.0
14    114700.0
15     74800.0
16    116300.0
17    159400.0
18     72700.0
19     98700.0
20     99600.0
21    102100.0
22    147800.0
23     70000.0
24     92000.0
25    111000.0
26     76000.0
27     66400.0
28    112000.0
29     88500.0
30    115900.0
31     84500.0
32     71300.0
33    118800.0
34    106600.0
35    100700.0
36    132900.0
37    137800.0
38     99300.0
39    107300.0
40     50700.0
41     65300.0
42    132500.0
43     57600.0
44    122000.0
45    126800.0
46     95400.0
47     66700.0
48     87300.0
49     65400.0
dtype: float64

In [33]:
# to add new Pandas dataframe column. We can add this to our existing dataframe with the .insert() method
spread_col = clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
clean_df.insert(1,'Spread',spread_col)
clean_df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

In [36]:
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html
# Sorting by the Lowest Spread
#To see which degrees have the smallest spread, we can use the .sort_values() method.
low_risk = clean_df.sort_values('Spread')

#since we are interested in only seeing the name of the degree and the major,
#we can pass a list of these two column names to look at the .head() of these two columns exclusively
low_risk[['Undergraduate Major', 'Spread']].head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

In [92]:
#Challenge 1:Using the .sort_values() method, can you find the degrees with the highest potential? 
#Find the top 5 degrees with the highest values in the 90th percentile. 

highest = clean_df.sort_values('Mid-Career 90th Percentile Salary',ascending=False)
highest[['Undergraduate Major','Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

In [93]:
#Challenge 2 Also, find the degrees with the greatest spread in salaries. 
#Which majors have the largest difference between high and low earners after graduation.
greatest_spread_salaries = clean_df.sort_values('Spread',ascending=False)
greatest_spread_salaries[['Undergraduate Major','Spread']].head()

   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

In [94]:
highest_spread = clean_df.sort_values('Mid-Career Median Salary',ascending=False)
highest_spread[['Undergraduate Major','Mid-Career Median Salary']].head()

       Undergraduate Major  Mid-Career Median Salary
8     Chemical Engineering                  107000.0
12    Computer Engineering                  105000.0
19  Electrical Engineering                  103000.0
1    Aerospace Engineering                  101000.0
17               Economics                   98600.0

In [101]:
#Grouping and Pivoting Data with Pandas : sum rows that below to a particular category
#To learn to use the .groupby() method.

# to count the groups, three categories in the 'Group' column:
clean_df.groupby('Group').count()


#Number formats in the Output: use 2 decimal places and more readable format
pd.options.display.float_format = '{:,.2f}'.format 


#use the .mean() method to find the average salary by group
clean_df.groupby('Group').mean()

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"

In [ ]:
#Learning Points & Summary:
"""

Today's Learning Points


Use .head(), .tail(), .shape and .columns to explore your DataFrame and find out the number of rows and columns as well as the column names.

Look for NaN (not a number) values with .findna() and consider using .dropna() to clean up your DataFrame.

You can access entire columns of a DataFrame using the square bracket notation: df['column name'] or df[['column name 1', 'column name 2', 'column name 3']]

You can access individual cells in a DataFrame by chaining square brackets df['column name'][index] or using df['column name'].loc[index]

The largest and smallest values, as well as their positions, can be found with methods like .max(), .min(), .idxmax() and .idxmin()

You can sort the DataFrame with .sort_values() and add new columns with .insert()

To create an Excel Style Pivot Table by grouping entries that belong to a particular category use the .groupby() method



"""